# ðŸ“Š CSV Analysis
This notebook loads and analyzes a CSV file using pandas.

In [2]:
import pandas as pd

df = pd.read_csv('sample_data.csv')
df.head()

      Name  Age Department
0    Alice   25         HR
1      Bob   32         IT
2  Charlie   45    Finance
3    David   28  Marketing
4      Eva   35         IT

In [4]:
df.describe()

             Age
count   5.000000
mean   33.000000
std     7.713624
min    25.000000
25%    28.000000
50%    32.000000
75%    35.000000
max    45.000000

In [6]:
df[df['Age'] > 30]

      Name  Age Department
1      Bob   32         IT
2  Charlie   45    Finance
4      Eva   35         IT